In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
# creating DataFrame

data = {"Age" : [25,27,29,30,32], "Salary" : [20000,40000,60000,80000,100000]}
df = pd.DataFrame(data)
df

   Age  Salary
0   25   20000
1   27   40000
2   29   60000
3   30   80000
4   32  100000

In [4]:
#Standardization using StandardScaler

from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaled = scaler.fit_transform(df)
scaled_df = pd.DataFrame(scaled, columns = df.columns)
print(scaled_df)

        Age    Salary
0 -1.489691 -1.414214
1 -0.662085 -0.707107
2  0.165521  0.000000
3  0.579324  0.707107
4  1.406930  1.414214

In [5]:
#Standardization using Normalizer

from sklearn.preprocessing import Normalizer
normal = Normalizer()
normalised = normal.fit_transform(df)
normalised_df = pd.DataFrame(normalised, columns = df.columns)
normalised_df

        Age    Salary
0  0.001250  0.999999
1  0.000675  1.000000
2  0.000483  1.000000
3  0.000375  1.000000
4  0.000320  1.000000